mahdi-benhassen/esp-agrinet-zigbee-glm5.2/rcp/sdkconfig.defaults
# ESP32-H2 Radio Coprocessor (RCP) configuration
#
# Built from ESP-IDF examples/openthread/ot_rcp with the Zigbee vendor hook.
# The CI workflow copies this file into the ot_rcp example directory before
# building.
#
# The key option is OPENTHREAD_NCP_VENDOR_HOOK which adds the Zigbee-specific
# Spinel hooks needed by the ESP Zigbee gateway host firmware.

CONFIG_IDF_TARGET="esp32h2"

# Enable Zigbee vendor hook in the OpenThread RCP
CONFIG_OPENTHREAD_NCP_VENDOR_HOOK=y

# UART console on UART0 (USB bridge on DevKitM)
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# Size-optimisation defaults (matching ot_rcp example)
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_SILENT=y
CONFIG_COMPILER_OPTIMIZATION_CHECKS_SILENT=y
CONFIG_ESP_ERR_TO_NAME_LOOKUP=n
CONFIG_ESP_SYSTEM_PANIC_SILENT_REBOOT=y
CONFIG_LOG_DEFAULT_LEVEL_NONE=y
CONFIG_LIBC_NEWLIB_NANO_FORMAT=y
CONFIG_OPENTHREAD_LOG_LEVEL_DYNAMIC=n
CONFIG_OPENTHREAD_LOG_LEVEL_NONE=y
